var qoutsList = [ "من قال أنا عالم فهو جاهل" ,
 "ما ندمت على سكوتي مرة، لكنني ندمت على الكلام مراراً" ,
"إذا ضاقت عليك الأرض بما رحبت، وعظمت عليك الهموم والغموم، وأصبحت في ضيق، وغلق العباد أبوابهم فاعلم أن الله سبحانه وتعالى لا يغلق بابه",
" عظ الناس بفعلك ، ولا تعظهم بقولك ",
"لا يبلغ العبد حقيقة التقوى حتى يدع ما حاك في الصَّدر"
]

var authList = [" عمر بن الخطاب" , "الامام الشافعي" , " بن محمدالمختار الشنقيطي" , "الحسن البصري", "عبدالله بن عمر"]


function randomQ () {
    var theNum = Math.floor( qoutsList.length *Math.random())

        document.getElementById("main-hero").innerHTML =`<p>`+ qoutsList[theNum] + `</p>
        <span>`+ authList[theNum]  + ` -</span>`

}



